Revit 2027 API
CoordinationModelLinkData.SourcePath Property
 The full source path of the external resource defining this Coordination Model link.
 For a Coordination Model from Autodesk Docs, sourcePath is the URN of the .svf file and it should look like "https://developer.api.autodesk.com/modelderivative/v2/designdata/dXJuOmFkc2sub2JqZWN0czpvcy5vYmplY3Q6Zm9yZ2UtYmxvZy1wb3N0L1VyYmFuSG91c2UtMjAxNS5ydnQ/manifest/urn:adsk.viewing:fs.file:dXJuOmFkc2sub2JqZWN0czpvcy5vYmplY3Q6Zm9yZ2UtYmxvZy1wb3N0L1VyYmFuSG91c2UtMjAxNS5ydnQ/output/Resource/3D_View/3D_Architectural 144171/3D_Architectural.svf".
 For a local Coordination Model, sourcePath is the absolute path on disk to the .nwc or .nwd file and it should look like "c:\Models\local.nwc".
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SourcePath { get; }
Public ReadOnly Property SourcePath As String
	Get
public:
property String^ SourcePath {
	String^ get ();
}
member SourcePath : string with get
Property Value
String
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace